// ==========================================
// 1. 會訊設定區
// ==========================================
const BOOK_SETTINGS = [
    { id: "114-03", title: "第三期 2026.06", ext: "webp", totalPages: 44 },
    { id: "114-02", title: "第二期 2026.03", ext: "webp", totalPages: 48 },
    { id: "114-01", title: "創刊號 2025.11", ext: "webp", totalPages: 15 }
];

// ==========================================
// 2. 會議紀錄資料庫
// ==========================================
const MINUTES_DATABASE = [
    { date: "2025-09-17", title: "114學年度第一次會員代表大會會議紀錄", file: "../files/minutes/20250917_114學年度第一次會員代表大會會議紀錄.pdf" },
    { date: "2026-01-12", title: "114學年度第一次家長委員會會議記錄", file: "../files/minutes/20251002_114學年度第一次家長委員會會議記錄.pdf" },
    { date: "2026-01-12", title: "114學年度第二次家長委員會會議記錄", file: "../files/minutes/20260112_114學年度第二次家長委員會會議記錄.pdf" },
    { date: "2026-03-04", title: "114學年度第三次家長委員會會議紀錄", file: "../files/minutes/20260304_114學年度第三次家長委員會會議紀錄.pdf" },
    { date: "2026-05-06", title: "114學年度第四次家長委員會會議紀錄", file: "../files/minutes/20260506_114學年度第四次家長委員會會議紀錄.pdf" },
    { date: "2026-08-27", title: "114學年度第五次家長委員會會議紀錄", file: "../files/minutes/20260827_114學年度第五次家長委員會會議記錄.pdf" },
    { date: "2026-01-12", title: "114學年度第一次常委會會議紀錄", file: "../files/minutes/20251002_114學年度第一次常委會會議紀錄.pdf" }



];

// ==========================================
// 3. 捐款芳名錄資料庫
// ==========================================
const DONORS_DATABASE = [
    { year: "115學年度", title: "各項指定捐款", file: "../files/donors/114-1家長會捐款芳名錄_各項指定捐款_截至20251231.jpg" },
    { year: "114學年度", title: "廁所香香指定捐款", file: "../files/donors/114-1家長會捐款芳名錄_廁所香香指定捐款_截至2025123.jpg" },
    { year: "114學年度", title: "一般會務捐款", file: "../files/donors/114-1家長會捐款芳名錄_一般會務捐款_截至20251231.jpg" }

];

// ==========================================
// 4. 各式章程資料庫
// ==========================================
const RULES_DATABASE = [
    { title: "組織章程", file: "../files/rules/組織章程.pdf" },
    { title: "選舉罷免辦法", file: "../files/rules/選舉罷免辦法.pdf" },
    { title: "非現金物資捐贈處理原則", file: "../files/rules/非現金物資捐贈處理原則.pdf" },
    { title: "資訊服務網站之設置目的及管理辦法", file: "../files/rules/資訊服務網站之設置目的及管理辦法.pdf" }
];